# Given Data Set

In [1]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1. Some values in the the FlightNumber column are missing. 
These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [4]:
def ReplaceFlightNumber(a):
    lst=[]
    for i in a:
        if ~np.isnan(i):
            lst.append(int(i))
        if ~np.isnan(i):
            j=i
        else:
            lst.append(int(j)+10)
    return lst

In [5]:
df['NewFlightNumber']=df['FlightNumber']

In [6]:
df['NewFlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: NewFlightNumber, dtype: float64

In [7]:
ReplaceFlightNumber(df['NewFlightNumber'])

[10045, 10055, 10065, 10075, 10085]

In [8]:
df['NewFlightNumber']=ReplaceFlightNumber(df['NewFlightNumber'])

In [9]:
df['NewFlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: NewFlightNumber, dtype: int64

In [10]:
df

,From_To,FlightNumber,RecentDelays,Airline,NewFlightNumber
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),10045
1,MAdrid_miLAN,NaN,[],<Air France> (12),10055
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),10065
3,Budapest_PaRis,NaN,[13],12. Air France,10075
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",10085

# 2. The From_To column would be better as two separate columns! 
Split each string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [11]:
df

,From_To,FlightNumber,RecentDelays,Airline,NewFlightNumber
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),10045
1,MAdrid_miLAN,NaN,[],<Air France> (12),10055
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),10065
3,Budapest_PaRis,NaN,[13],12. Air France,10075
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",10085

In [12]:
df[['From','To']]=df.From_To.str.split('_', expand=True)

In [13]:
df

,From_To,FlightNumber,RecentDelays,Airline,NewFlightNumber,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),10045,LoNDon,paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),10055,MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),10065,londON,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,10075,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",10085,Brussels,londOn

# 3. Notice how the capitalisation of the city names is all mixed up 
in this temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [14]:
def Custom_Capitalize(col):
    lst=[]
    nlst=[]
    for i in col:
        lst.append(i.lower())
    for i in range(len(lst)):
        nlst.append(lst[i].title())
    
    return nlst

In [15]:
df['From']=Custom_Capitalize(df['From'])

In [16]:
df

,From_To,FlightNumber,RecentDelays,Airline,NewFlightNumber,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),10045,London,paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),10055,Madrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),10065,London,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,10075,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",10085,Brussels,londOn

In [17]:
df['To']=Custom_Capitalize(df['To'])

In [18]:
df

,From_To,FlightNumber,RecentDelays,Airline,NewFlightNumber,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),10045,London,Paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),10055,Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),10065,London,Stockholm
3,Budapest_PaRis,NaN,[13],12. Air France,10075,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",10085,Brussels,London

# 4. Delete the From_To column from df 
and attach the temporary DataFrame from the previous questions.

In [19]:
df.drop('From_To',axis=1,inplace=True)

In [20]:
df

,FlightNumber,RecentDelays,Airline,NewFlightNumber,From,To
0,10045.0,"[23, 47]",KLM(!),10045,London,Paris
1,NaN,[],<Air France> (12),10055,Madrid,Milan
2,10065.0,"[24, 43, 87]",(British Airways. ),10065,London,Stockholm
3,NaN,[13],12. Air France,10075,Budapest,Paris
4,10085.0,"[67, 32]","""Swiss Air""",10085,Brussels,London

# 5. In the RecentDelays column, the values have been entered into theDataFrame as a list. 
We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [21]:
df['RecentDelays'].values.tolist()

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [22]:
df[['delay_1','delay_2','delay_3']]=pd.DataFrame(df['RecentDelays'].values.tolist())

In [23]:
df

,FlightNumber,RecentDelays,Airline,NewFlightNumber,From,To,delay_1,delay_2,delay_3
0,10045.0,"[23, 47]",KLM(!),10045,London,Paris,23.0,47.0,NaN
1,NaN,[],<Air France> (12),10055,Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),10065,London,Stockholm,24.0,43.0,87.0
3,NaN,[13],12. Air France,10075,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",10085,Brussels,London,67.0,32.0,NaN

In [24]:
df.drop('RecentDelays',axis=1,inplace=True)

In [26]:
df.drop('FlightNumber',axis=1,inplace=True)

In [27]:
df

,Airline,NewFlightNumber,From,To,delay_1,delay_2,delay_3
0,KLM(!),10045,London,Paris,23.0,47.0,NaN
1,<Air France> (12),10055,Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),10065,London,Stockholm,24.0,43.0,87.0
3,12. Air France,10075,Budapest,Paris,13.0,NaN,NaN
4,"""Swiss Air""",10085,Brussels,London,67.0,32.0,NaN